sergeykhbr/gardemarin/examples/sim/libst32sim/src/s32k148regs.h
/*
 *  Copyright 2024 Sergey Khabarov, sergeykhbr@gmail.com
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

#pragma once

#include <inttypes.h>

#ifndef __IO
#ifdef __cplusplus
  #define   __I     volatile             /*!< Defines 'read only' permissions                 */
#else
  #define   __I     volatile const       /*!< Defines 'read only' permissions                 */
#endif
#define     __O     volatile             /*!< Defines 'write only' permissions                */
#define     __IO    volatile             /*!< Defines 'read / write' permissions              */
#endif


#define CANFD_ENA
//#define LOOPBACK_MODE_ENA

#ifdef CANFD_ENA
#define MSG_BUF_SIZE  18
#define CANFD_BRS_DISABLE
#else
#define MSG_BUF_SIZE  4		/* Msg Buffer Size. (CAN 2.0AB: 2 hdr +  2 data= 4 words) */
#define CAN2_80MHZ
#endif


// page 1642: CAN register list

typedef struct can_mcr_bits_t {
    volatile uint32_t MAXMB : 7;     // [6:0]
    volatile uint32_t rsv7 : 1;      // [7]
    volatile uint32_t IDAM : 2;      // [9:8]
    volatile uint32_t rsv10 : 1;     // [10]
    volatile uint32_t FDEN : 1;      // [11]
    volatile uint32_t AEN : 1;       // [12]
    volatile uint32_t LPRIOEN : 1;   // [13]
    volatile uint32_t PNET_EN : 1;   // [14]
    volatile uint32_t DMA : 1;       // [15]
    volatile uint32_t IRMQ : 1;      // [16]
    volatile uint32_t SRXDIS : 1;    // [17]
    volatile uint32_t rsv19_18 : 2;  // [19:18]
    volatile uint32_t LPMACK : 1;    // [20]
    volatile uint32_t WRNEN : 1;     // [21]
    volatile uint32_t rsv22 : 1;     // [22]
    volatile uint32_t SUPV : 1;      // [23]
    volatile uint32_t FRZACK : 1;    // [24]
    volatile uint32_t SOFTRST : 1;   // [25]
    volatile uint32_t rsv26 : 1;     // [26]
    volatile uint32_t NOTRDY : 1;    // [27]
    volatile uint32_t HALT : 1;      // [28]
    volatile uint32_t RFEN : 1;      // [29]
    volatile uint32_t FRZ : 1;       // [30]
    volatile uint32_t MDIS : 1;      // [31]
} can_mcr_bits_t;

typedef union can_mcr_reg_t {
    volatile uint32_t value;
    can_mcr_bits_t bits;
} can_mcr_reg_t;

typedef struct can_ctrl1_bits_t {
    volatile uint32_t PROPSEG : 3;   // [2:0] Propagation segment
    volatile uint32_t LOM : 1;       // [3] Listen-only mode: 1=ena
    volatile uint32_t LBUF : 1;      // [4] Lowest buffer transmitted first: 1=ena
    volatile uint32_t TSYN : 1;      // [5] Timer sync: 1=feature enabled
    volatile uint32_t BOFFREC : 1;   // [6] Bus Off Recovery: 1=auto recovery disabled
    volatile uint32_t SMP : 1;       // [7] CAN bit sampling: 0=one sample per bit; 1=3 samples per bit
    volatile uint32_t rsrv9_8 : 2;   // [9:8] 
    volatile uint32_t RWRNMSK : 1;   // [10] Rx Warning Interrupt Mask
    volatile uint32_t TWRNMSK : 1;   // [11] Tx Warning Interrupt Mask
    volatile uint32_t LPB : 1;       // [12] Loop Back mode
    volatile uint32_t CLKSRC : 1;    // [13] CAN engine clk source:0=engine clk; 1=periph clk
    volatile uint32_t ERRMSK : 1;    // [14] Error interrupt mask: 1=enabled
    volatile uint32_t BOFFMSK : 1;   // [15] Bus Off Interript mask: 1=enabled
    volatile uint32_t PSEG2 : 3;     // [18:16] Phase segment 2
    volatile uint32_t PSEG1 : 3;     // [21:19] Phase segment 1
    volatile uint32_t RJW : 2;       // [23:22] Resync Jump width
    volatile uint32_t PRESDIV : 8;   // [31:24] Prescale division factor: sclk=peclk/(presdiv+1)
} can_ctrl1_bits_t;

typedef union can_ctrl1_reg_t {
    volatile uint32_t value;
    can_ctrl1_bits_t bits;
} can_ctrl1_reg_t;

// CAN Bit Timing register (alternative to CTRL1)
typedef struct can_cbt_bits_t {
    volatile uint32_t EPSEG2 : 5;       // [4:0] Extended Phase Segment 2
    volatile uint32_t EPSEG1 : 5;       // [9:5] Extended Phase Segment 1
    volatile uint32_t EPROPSEG : 6;     // [15:10] Extended Propagation Segment
    volatile uint32_t ERJW : 5;         // [20:16] Extended Resync Jump Width
    volatile uint32_t EPRESDIV : 10;    // [30:21] Extended prescale division factor
    volatile uint32_t BTF : 1;          // [31] Bit Timing Format Enable, must be 1 for CANFD
} can_cbt_bits_t;

typedef union can_cbt_reg_t {
    volatile uint32_t value;
    can_cbt_bits_t bits;
} can_cbt_reg_t;

// CAN-FD Bit Timing register
typedef struct can_fdcbt_bits_t {
    volatile uint32_t FPSEG2 : 3;       // [2:0] Fast Phase Segment 2
    volatile uint32_t rsv4_3 : 2;       // [4:3]
    volatile uint32_t FPSEG1 : 3;       // [7:5] Fast Phase Segment 1
    volatile uint32_t rsv9_8 : 2;       // [9:8]
    volatile uint32_t FPROPSEG : 5;     // [15:10] Fast Propagation Segment
    volatile uint32_t rsv15 : 1;        // [15]
    volatile uint32_t FRJW : 3;         // [18:16] Fast Resync Jump Width
    volatile uint32_t rsv19 : 1;        // [19]
    volatile uint32_t FPRESDIV : 10;    // [29:20] Fast prescale division factor
    volatile uint32_t rsv31_30 : 2;     // [31:30]
} can_fdcbt_bits_t;

typedef union can_fdcbt_reg_t {
    volatile uint32_t value;
    can_fdcbt_bits_t bits;
} can_fdcbt_reg_t;


// CAN-FD Control register
typedef struct can_fdctrl_bits_t {
    volatile uint32_t TDCVAL : 6;       // [5:0] Transceiver delay compensation value
    volatile uint32_t rsv7_6 : 2;       // [7:6]
    volatile uint32_t TDCOFF : 5;       // [12:8] Transceiver delay compensation offset
    volatile uint32_t rsv13 : 1;        // [13]
    volatile uint32_t TDCFAIL : 1;      // [14] Transceiver delay compensation fail
    volatile uint32_t TDCEN : 1;        // [15] Transceiver delay compensation enable
    volatile uint32_t MBDSR0 : 2;       // [17:16] Message Buffer Data size for region 0: 0=8B; 1=16B; 2=32B; 3=64B
    volatile uint32_t rsv30_18 : 13;    // [30:18]
    volatile uint32_t FDRATE : 1;       // [31] Bit rate Switch Enable
} can_fdctrl_bits_t;

typedef union can_fdctrl_reg_t {
    volatile uint32_t value;
    can_fdctrl_bits_t bits;
} can_fdctrl_reg_t;


