sergeykhbr/gardemarin/examples/sim/libst32sim/src/s32k148regs.h
typedef struct can_ctrl2_bits_t {
    volatile uint32_t rsv10_0 : 11;     // [10:0]
    volatile uint32_t EDFLTDI : 1;      // [11] Edge filter disable
    volatile uint32_t ISOCANFDEN : 1;   // [12] ISO CAN FD enable
    volatile uint32_t rsrv13 : 1;       // [13] 
    volatile uint32_t PREXCEN : 1;      // [14] Protocol exception enable
    volatile uint32_t TIMER_SRC : 1;    // [15] Timer source (for CAN0 only): 0=timer clocked by CAN bit clock
    volatile uint32_t EACEN : 1;        // [16] Entire frame arbitration field comparision enable for Rx mailboxes
    volatile uint32_t RRS : 1;          // [17] Remote request storing
    volatile uint32_t MRP : 1;          // [18] Mailboxes Reception Priority
    volatile uint32_t TASD : 5;         // [23:19] Tx Arbitration start delay
    volatile uint32_t RFFN : 4;         // [27:24] Number of Rx FIFO filters
    volatile uint32_t rsv29_28 : 2;     // [29:28]
    volatile uint32_t BOFFDONEMS : 1;   // [30] Bus Off Done Interrupt Mask (0=dis)
    volatile uint32_t ERRMSK_FAST : 1;  // [31] Error interrupt Mask in Data phase for CANFD (0=dis)
} can_ctrl2_bits_t;

typedef union can_ctrl2_reg_t {
    volatile uint32_t value;
    can_ctrl2_bits_t bits;
} can_ctrl2_reg_t;


typedef struct can_frame_bits_t {
    volatile uint32_t timestamp : 16;        // [0][15:0] free running counter
    volatile uint32_t DLC : 4;               // [0][19:16] Length of Data bytes
    volatile uint32_t RTR : 1;               // [0][20] Remote Transmition Request
    volatile uint32_t IDE : 1;               // [0][21] ID Extended Bit
    volatile uint32_t SRR : 1;               // [0][22] Substitute Remote Request
    volatile uint32_t rsv023 : 1;            // [0][23]
    volatile uint32_t CODE : 4;              // [0][27:24] Message buffer code: 0xC = Tx Data Frame (RTR must be 0)
    volatile uint32_t rsv028 : 1;            // [0][28]
    volatile uint32_t ESI : 1;               // [0][29] Error state indicator
    volatile uint32_t BRS : 1;               // [0][30] Bit Rate Switch inside CAN FD frame
    volatile uint32_t EDL : 1;               // [0][31] Extended Data Length: 1=CANFD
    volatile uint32_t IDEXT : 18;            // [1][17:0]
    volatile uint32_t IDSTD : 11;            // [1][28:18] Frame ID
    volatile uint32_t PRIO : 3;              // [1][31:29] Local Prioirty
    char data[64];
} can_frame_bits_t;

typedef union can_frame_t {
    volatile uint32_t buf[18];
    can_frame_bits_t bits;
} can_frame_t;

/** CAN - Size of Registers Arrays */
#define CAN_RAMn_COUNT                           128u
#define CAN_RXIMR_COUNT                          32u
#define CAN_WMB_COUNT                            4u

/** CAN - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t CTRL1;                             /**< Control 1 register, offset: 0x4 */
  __IO uint32_t TIMER;                             /**< Free Running Timer, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t RXMGMASK;                          /**< Rx Mailboxes Global Mask Register, offset: 0x10 */
  __IO uint32_t RX14MASK;                          /**< Rx 14 Mask register, offset: 0x14 */
  __IO uint32_t RX15MASK;                          /**< Rx 15 Mask register, offset: 0x18 */
  __IO uint32_t ECR;                               /**< Error Counter, offset: 0x1C */
  __IO uint32_t ESR1;                              /**< Error and Status 1 register, offset: 0x20 */
       uint8_t RESERVED_1[4];
  __IO uint32_t IMASK1;                            /**< Interrupt Masks 1 register, offset: 0x28 */
       uint8_t RESERVED_2[4];
  __IO uint32_t IFLAG1;                            /**< Interrupt Flags 1 register, offset: 0x30 */
  __IO uint32_t CTRL2;                             /**< Control 2 register, offset: 0x34 */
  __I  uint32_t ESR2;                              /**< Error and Status 2 register, offset: 0x38 */
       uint8_t RESERVED_3[8];
  __I  uint32_t CRCR;                              /**< CRC Register, offset: 0x44 */
  __IO uint32_t RXFGMASK;                          /**< Rx FIFO Global Mask register, offset: 0x48 */
  __I  uint32_t RXFIR;                             /**< Rx FIFO Information Register, offset: 0x4C */
  __IO uint32_t CBT;                               /**< CAN Bit Timing Register, offset: 0x50 */
       uint8_t RESERVED_4[44];
  __IO uint32_t RAMn[CAN_RAMn_COUNT];              /**< Embedded RAM, array offset: 0x80, array step: 0x4 */
       uint8_t RESERVED_5[1536];
  __IO uint32_t RXIMR[CAN_RXIMR_COUNT];            /**< Rx Individual Mask Registers, array offset: 0x880, array step: 0x4 */
       uint8_t RESERVED_6[512];
  __IO uint32_t CTRL1_PN;                          /**< Pretended Networking Control 1 Register, offset: 0xB00 */
  __IO uint32_t CTRL2_PN;                          /**< Pretended Networking Control 2 Register, offset: 0xB04 */
  __IO uint32_t WU_MTC;                            /**< Pretended Networking Wake Up Match Register, offset: 0xB08 */
  __IO uint32_t FLT_ID1;                           /**< Pretended Networking ID Filter 1 Register, offset: 0xB0C */
  __IO uint32_t FLT_DLC;                           /**< Pretended Networking DLC Filter Register, offset: 0xB10 */
  __IO uint32_t PL1_LO;                            /**< Pretended Networking Payload Low Filter 1 Register, offset: 0xB14 */
  __IO uint32_t PL1_HI;                            /**< Pretended Networking Payload High Filter 1 Register, offset: 0xB18 */
  __IO uint32_t FLT_ID2_IDMASK;                    /**< Pretended Networking ID Filter 2 Register / ID Mask Register, offset: 0xB1C */
  __IO uint32_t PL2_PLMASK_LO;                     /**< Pretended Networking Payload Low Filter 2 Register / Payload Low Mask Register, offset: 0xB20 */
  __IO uint32_t PL2_PLMASK_HI;                     /**< Pretended Networking Payload High Filter 2 low order bits / Payload High Mask Register, offset: 0xB24 */
       uint8_t RESERVED_7[24];
  struct {                                         /* offset: 0xB40, array step: 0x10 */
    __I  uint32_t WMBn_CS;                           /**< Wake Up Message Buffer Register for C/S, array offset: 0xB40, array step: 0x10 */
    __I  uint32_t WMBn_ID;                           /**< Wake Up Message Buffer Register for ID, array offset: 0xB44, array step: 0x10 */
    __I  uint32_t WMBn_D03;                          /**< Wake Up Message Buffer Register for Data 0-3, array offset: 0xB48, array step: 0x10 */
    __I  uint32_t WMBn_D47;                          /**< Wake Up Message Buffer Register Data 4-7, array offset: 0xB4C, array step: 0x10 */
  } WMB[CAN_WMB_COUNT];
       uint8_t RESERVED_8[128];
  __IO uint32_t FDCTRL;                            /**< CAN FD Control Register, offset: 0xC00 */
  __IO uint32_t FDCBT;                             /**< CAN FD Bit Timing Register, offset: 0xC04 */
  __I  uint32_t FDCRC;                             /**< CAN FD CRC Register, offset: 0xC08 */
} CAN_Type;



typedef struct lmem_pcccr_bits_t {
    volatile uint32_t ENCACHE : 1;   // [0] Cache Enable
    volatile uint32_t rsv1 : 1;      // [1]
    volatile uint32_t PCCR2 : 1;     // [2] Force all cachable spaces to write through
    volatile uint32_t PCCR3 : 1;     // [3] Force no allocation on cache miss
    volatile uint32_t rsv23_4 : 20;  // [23:4] 
    volatile uint32_t INVW0 : 1;     // [24] Invalidate way 0
    volatile uint32_t PUSHW0 : 1;    // [25] Push way 0 when GO=1
    volatile uint32_t INVW1 : 1;     // [26] Invalidate way 1
    volatile uint32_t PUSHW1 : 1;    // [27] Push way 1 when GO=1
    volatile uint32_t rsv30_28 : 3;  // [30:28]
    volatile uint32_t GO : 1;        // [31] Initiate Cache command
} lmem_pcccr_bits_t;

typedef union lmem_pcccr_reg_t {
    volatile uint32_t value;
    lmem_pcccr_bits_t bits;
} lmem_pcccr_reg_t;


/** LMEM - Register Layout Typedef */
typedef struct {
  __IO uint32_t PCCCR;                             /**< Cache control register, offset: 0x0 */
  __IO uint32_t PCCLCR;                            /**< Cache line control register, offset: 0x4 */
  __IO uint32_t PCCSAR;                            /**< Cache search address register, offset: 0x8 */
  __IO uint32_t PCCCVR;                            /**< Cache read/write value register, offset: 0xC */
       uint8_t RESERVED_0[16];
  __IO uint32_t PCCRMR;                            /**< Cache regions mode register, offset: 0x20 */
} LMEM_Type, *LMEM_MemMapPtr;



