sergeykhbr/gardemarin/examples/sim/libst32sim/src/s32k148regs.h
/** S32_NVIC - Size of Registers Arrays */
#define S32_NVIC_ISER_COUNT                      8u
#define S32_NVIC_ICER_COUNT                      8u
#define S32_NVIC_ISPR_COUNT                      8u
#define S32_NVIC_ICPR_COUNT                      8u
#define S32_NVIC_IABR_COUNT                      8u
#define S32_NVIC_IP_COUNT                        240u

typedef struct {
  __IO uint32_t ISER[S32_NVIC_ISER_COUNT];         /**< Interrupt Set Enable Register n, array offset: 0x0, array step: 0x4 */
       uint8_t RESERVED_0[96];
  __IO uint32_t ICER[S32_NVIC_ICER_COUNT];         /**< Interrupt Clear Enable Register n, array offset: 0x80, array step: 0x4 */
       uint8_t RESERVED_1[96];
  __IO uint32_t ISPR[S32_NVIC_ISPR_COUNT];         /**< Interrupt Set Pending Register n, array offset: 0x100, array step: 0x4 */
       uint8_t RESERVED_2[96];
  __IO uint32_t ICPR[S32_NVIC_ICPR_COUNT];         /**< Interrupt Clear Pending Register n, array offset: 0x180, array step: 0x4 */
       uint8_t RESERVED_3[96];
  __IO uint32_t IABR[S32_NVIC_IABR_COUNT];         /**< Interrupt Active bit Register n, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_4[224];
  __IO uint8_t IP[S32_NVIC_IP_COUNT];              /**< Interrupt Priority Register n, array offset: 0x300, array step: 0x1 */
       uint8_t RESERVED_5[2576];
  __O  uint32_t STIR;                              /**< Software Trigger Interrupt Register, offset: 0xE00 */
} S32_NVIC_Type;




/** PCC_Peripheral_Access_Layer PCC Peripheral Access Layer */
#define PCC_FTFC_INDEX                           32
#define PCC_DMAMUX_INDEX                         33
#define PCC_FlexCAN0_INDEX                       36
#define PCC_FlexCAN1_INDEX                       37
#define PCC_FTM3_INDEX                           38
#define PCC_ADC1_INDEX                           39
#define PCC_FlexCAN2_INDEX                       43
#define PCC_LPSPI0_INDEX                         44
#define PCC_LPSPI1_INDEX                         45
#define PCC_LPSPI2_INDEX                         46
#define PCC_PDB1_INDEX                           49
#define PCC_CRC_INDEX                            50
#define PCC_PDB0_INDEX                           54
#define PCC_LPIT_INDEX                           55
#define PCC_FTM0_INDEX                           56
#define PCC_FTM1_INDEX                           57
#define PCC_FTM2_INDEX                           58
#define PCC_ADC0_INDEX                           59
#define PCC_RTC_INDEX                            61
#define PCC_LPTMR0_INDEX                         64
#define PCC_PORTA_INDEX                          73
#define PCC_PORTB_INDEX                          74
#define PCC_PORTC_INDEX                          75
#define PCC_PORTD_INDEX                          76
#define PCC_PORTE_INDEX                          77
#define PCC_SAI0_INDEX                           84
#define PCC_SAI1_INDEX                           85
#define PCC_FlexIO_INDEX                         90
#define PCC_EWM_INDEX                            97
#define PCC_LPI2C0_INDEX                         102
#define PCC_LPI2C1_INDEX                         103
#define PCC_LPUART0_INDEX                        106
#define PCC_LPUART1_INDEX                        107
#define PCC_LPUART2_INDEX                        108
#define PCC_FTM4_INDEX                           110
#define PCC_FTM5_INDEX                           111
#define PCC_FTM6_INDEX                           112
#define PCC_FTM7_INDEX                           113
#define PCC_CMP0_INDEX                           115
#define PCC_QSPI_INDEX                           118
#define PCC_ENET_INDEX                           121

#define PCC_PCCn_COUNT                           122u

typedef struct pcc_bits_t {
    volatile uint32_t zero0 : 3;      // [2:0]
    volatile uint32_t zero1 : 1;      // [3]
    volatile uint32_t zero2 : 20;     // [23:4]
    volatile uint32_t PCS : 3;        // [26:24] Can be writen when CGC=0; 0=Clock is off; 1..7=Clock options
    volatile uint32_t zero3 : 2;      // [28:27]
    volatile uint32_t rsrv : 1;       // [29]
    volatile uint32_t CGC : 1;        // [30] Clock Gate Control: 0=clk disabled; 1=enabled
    volatile uint32_t PR : 1;         // [31] 0=periph is not presence; 1=presence
} pcc_bits_t;

typedef union pcc_reg_t {
    pcc_bits_t bits;
    volatile uint32_t value;
} pcc_reg_t;

typedef union {
  __IO uint32_t PCCn[PCC_PCCn_COUNT];
} PCC_Type;




/** GPIO - Register Layout Typedef */
typedef struct {
  __IO uint32_t PDOR;                              /**< Port Data Output Register, offset: 0x0 */
  __O  uint32_t PSOR;                              /**< Port Set Output Register, offset: 0x4 */
  __O  uint32_t PCOR;                              /**< Port Clear Output Register, offset: 0x8 */
  __O  uint32_t PTOR;                              /**< Port Toggle Output Register, offset: 0xC */
  __I  uint32_t PDIR;                              /**< Port Data Input Register, offset: 0x10 */
  __IO uint32_t PDDR;                              /**< Port Data Direction Register, offset: 0x14 */
  __IO uint32_t PIDR;                              /**< Port Input Disable Register, offset: 0x18 */
} GPIO_Type;

typedef struct port_pcr_bits_t {
    volatile uint32_t PS : 1;        // [0] Pull Select: 0=pulldown 1=pullup enabled if PE=1
    volatile uint32_t PE : 1;        // [1] Pull Enable
    volatile uint32_t rsv3_2 : 2;    // [3:2]
    volatile uint32_t PFE : 1;       // [4] Passive Filter Enable
    volatile uint32_t rsv5 : 1;      // [5]
    volatile uint32_t DSE : 1;       // [6] Drive Strength Enable
    volatile uint32_t rsv7 : 1;      // [7]
    volatile uint32_t MUX : 3;       // [10:8] 000=Pin disabled; 001=GPIO
    volatile uint32_t rsv14_11 : 4;  // [14:11]
    volatile uint32_t LK : 1;        // [15] Lock Register
    volatile uint32_t IRQC : 4;      // [19:16] IRQ config: 0=irq flag disabled
    volatile uint32_t rsv23_20 : 4;  // [23:20]
    volatile uint32_t ISF : 1;       // [24] ISF: Interrupt Status Flag
    volatile uint32_t rsv31_25 : 7;  // [31:25]
} port_pcr_bits_t;

