sergeykhbr/gardemarin/examples/sim/libst32sim/src/s32k148regs.h
typedef union port_pcr_reg_t {
    volatile uint32_t value;
    port_pcr_bits_t bits;
} port_pcr_reg_t;

/** PORT - Register Layout Typedef */
typedef struct {
  __IO uint32_t PCR[32];                           /**< Pin Control Register n, array offset: 0x0, array step: 0x4 */
  __O  uint32_t GPCLR;                             /**< Global Pin Control Low Register, offset: 0x80 */
  __O  uint32_t GPCHR;                             /**< Global Pin Control High Register, offset: 0x84 */
  __O  uint32_t GICLR;                             /**< Global Interrupt Control Low Register, offset: 0x88 */
  __O  uint32_t GICHR;                             /**< Global Interrupt Control High Register, offset: 0x8C */
       uint8_t RESERVED_0[16];
  __IO uint32_t ISFR;                              /**< Interrupt Status Flag Register, offset: 0xA0 */
       uint8_t RESERVED_1[28];
  __IO uint32_t DFER;                              /**< Digital Filter Enable Register, offset: 0xC0 */
  __IO uint32_t DFCR;                              /**< Digital Filter Clock Register, offset: 0xC4 */
  __IO uint32_t DFWR;                              /**< Digital Filter Width Register, offset: 0xC8 */
} PORT_Type;



// Coprocessor Access Control register
typedef struct scb_cpacr_bits_t {
    volatile uint32_t rsv19_0 : 20;    // [19:0]
    volatile uint32_t CP10 : 2;        // [21:20] Access privileges: 0=denied; 1=priv only; 2=rsrv; 3=full access
    volatile uint32_t CP11 : 2;        // [23:22] Access privileges: 0=denied; 1=priv only; 2=rsrv; 3=full access
    volatile uint32_t rsv31_24 : 8;    // [31:24]
} scb_cpacr_bits_t;

typedef union scb_cpacr_reg_t {
    volatile uint32_t value;            // reset value 0000_0000h
    scb_cpacr_bits_t bits;
} scb_cpacr_reg_t;

// Floating-point Context Control register
typedef struct scb_fpccr_bits_t {
    volatile uint32_t LSPACT : 1;       // [0]
    volatile uint32_t USER : 1;         // [1]
    volatile uint32_t rsrv2 : 1;        // [2]
    volatile uint32_t THREAD : 1;       // [3]
    volatile uint32_t HFRDY : 1;        // [4]
    volatile uint32_t MMRDY : 1;        // [5] 0=MemManage is disabled
    volatile uint32_t BFRDY : 1;        // [6] 0=BusFault is disabled
    volatile uint32_t rsrv8 : 1;        // [7]
    volatile uint32_t MONRDY : 1;       // [8] 0=Debug monitor is disabled
    volatile uint32_t rsv29_9 : 21;     // [29:9]
    volatile uint32_t LSPEN : 1;        // [30] Enable lazy state preservation
    volatile uint32_t ASPEN : 1;        // [31] Enable CONTROL<2> setting on exec of fpu
} scb_fpccr_bits_t;

typedef union scb_fpccr_reg_t {
    volatile uint32_t value;            // reset value C000_0000h
    scb_fpccr_bits_t bits;
} scb_fpccr_reg_t;


/** S32_SCB - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[8];
  __IO uint32_t ACTLR;                             /**< Auxiliary Control Register,, offset: 0x8 */
       uint8_t RESERVED_1[3316];
  __I  uint32_t CPUID;                             /**< CPUID Base Register, offset: 0xD00 */
  __IO uint32_t ICSR;                              /**< Interrupt Control and State Register, offset: 0xD04 */
  __IO uint32_t VTOR;                              /**< Vector Table Offset Register, offset: 0xD08 */
  __IO uint32_t AIRCR;                             /**< Application Interrupt and Reset Control Register, offset: 0xD0C */
  __IO uint32_t SCR;                               /**< System Control Register, offset: 0xD10 */
  __IO uint32_t CCR;                               /**< Configuration and Control Register, offset: 0xD14 */
  __IO uint32_t SHPR1;                             /**< System Handler Priority Register 1, offset: 0xD18 */
  __IO uint32_t SHPR2;                             /**< System Handler Priority Register 2, offset: 0xD1C */
  __IO uint32_t SHPR3;                             /**< System Handler Priority Register 3, offset: 0xD20 */
  __IO uint32_t SHCSR;                             /**< System Handler Control and State Register, offset: 0xD24 */
  __IO uint32_t CFSR;                              /**< Configurable Fault Status Registers, offset: 0xD28 */
  __IO uint32_t HFSR;                              /**< HardFault Status register, offset: 0xD2C */
  __IO uint32_t DFSR;                              /**< Debug Fault Status Register, offset: 0xD30 */
  __IO uint32_t MMFAR;                             /**< MemManage Address Register, offset: 0xD34 */
  __IO uint32_t BFAR;                              /**< BusFault Address Register, offset: 0xD38 */
  __IO uint32_t AFSR;                              /**< Auxiliary Fault Status Register, offset: 0xD3C */
       uint8_t RESERVED_2[72];
  __IO uint32_t CPACR;                             /**< Coprocessor Access Control Register, offset: 0xD88 */
       uint8_t RESERVED_3[424];
  __IO uint32_t FPCCR;                             /**< Floating-point Context Control Register, offset: 0xF34 */
  __IO uint32_t FPCAR;                             /**< Floating-point Context Address Register, offset: 0xF38 */
  __IO uint32_t FPDSCR;                            /**< Floating-point Default Status Control Register, offset: 0xF3C */
} S32_SCB_Type;


// System Oscillator Configuration register
typedef struct scg_sosccfg_bits_t {
    volatile uint32_t rsv1_0 : 2;    // [1:0]
    volatile uint32_t EREFS : 1;     // [2] External ref select: 0=ext; internal OSC
    volatile uint32_t HGO : 1;       // [3] High gain oscillator select: 0=low-gain;1=high-gain
    volatile uint32_t RANGE : 2;     // [5:4] System OSC range select: 0=reserved; 1=Low range; 2=medium; 3=high
    volatile uint32_t rsv31_6 : 26;  // [7:3]
} scg_sosccfg_bits_t;

typedef union scg_sosccfg_reg_t {
    volatile uint32_t value;         // reset value 0000_0010h
    scg_sosccfg_bits_t bits;
} scg_sosccfg_reg_t;

// System OSC Divide register
typedef struct scg_soscdiv_bits_t {
    volatile uint32_t SOSCDIV1 : 3;  // [2:0] System OSC Clock Divide 1: 0=disabled; 1=div by 1; ..
    volatile uint32_t rsv7_3 : 5;    // [7:3]
    volatile uint32_t SOSCDIV2 : 3;  // [10:8] System OSC Clock Divide 2: 0=disabled; 1=div by 1; ..
    volatile uint32_t rsv31_11 : 21; // [31:11]
} scg_soscdiv_bits_t;

typedef union scg_soscdiv_reg_t {
    volatile uint32_t value;         // reset value 0000_0000h
    scg_soscdiv_bits_t bits;
} scg_soscdiv_reg_t;

// System OSC Control Status register
typedef struct scg_sosccsr_bits_t {
    volatile uint32_t SOSCEN : 1;    // [0] System OSC Enable: 1=enabled
    volatile uint32_t rsv15_1 : 15;  // [15:1]
    volatile uint32_t SOSCCM : 1;    // [16] System OSC Clock Monitor: 1=Enabled
    volatile uint32_t SOSCCMRE : 1;  // [17] System OSC Clock Monitor Reset Enable
    volatile uint32_t rsv22_18 : 5;  // [22:18]
    volatile uint32_t LK : 1;        // [23] Lock Register: 1=register cannot be writen
    volatile uint32_t SOSCVLD : 1;   // [24] System OSC Valid
    volatile uint32_t SOSCSEL : 1;   // [25] System OSC selected: 0System OSC is not the system clk source
    volatile uint32_t SOSCERR : 1;   // [26] System OSC Clock Error
    volatile uint32_t rsv31_27 : 5;  // [31:27]
} scg_sosccsr_bits_t;

