sergeykhbr/gardemarin/examples/sim/libst32sim/src/s32k148regs.h
typedef union scg_sosccsr_reg_t {
    volatile uint32_t value;
    scg_sosccsr_bits_t bits;
} scg_sosccsr_reg_t;

// System PLL Control Status register
typedef struct scg_spllcsr_bits_t {
    volatile uint32_t SPLLEN : 1;       // [0] System PLL enable: 0=disabled
    volatile uint32_t rsv15_1 : 15;     // [15:1]
    volatile uint32_t SPLLCM : 1;       // [16] Clock Monitor: 0=disabled
    volatile uint32_t SPLLCMRE : 1;     // [17] Clock Monitor reset enable: 0=generate irq on error; 1=reset on error
    volatile uint32_t rsv22_18 : 5;     // [22:18]
    volatile uint32_t LK : 1;           // [23] Lock: 0=can be written; 1=cannot
    volatile uint32_t SPLLVLD : 1;      // [24] System PLL valid 
    volatile uint32_t SPLLSEL : 1;      // [25] System PLL selected: 0=not the system clock
    volatile uint32_t SPLLERR : 1;      // [26] System PLL clock error
    volatile uint32_t rsv31_27 : 5;     // [31:27]
} scg_spllcsr_bits_t;

typedef union scg_spllcsr_reg_t {
    volatile uint32_t value;         // reset value 0000_0000h
    scg_spllcsr_bits_t bits;
} scg_spllcsr_reg_t;

// Run Clock Control register/ Clock Status register has the same layout
typedef struct scg_rccr_bits_t {
    volatile uint32_t DIVSLOW : 4;      // [3:0] Slow clock div ratio:0=div by 1; 0x7=div by 8
    volatile uint32_t DIVBUS : 4;       // [7:4] Bus clock div ratio:0=div by 1; 0xf=div by 16
    volatile uint32_t rsv15_8 : 8;      // [15:8]
    volatile uint32_t DIVCORE : 4;      // [19:16] Core clock div ratio:0=div by 1; 0xf=div by 16
    volatile uint32_t rsv23_20 : 4;     // [23:20]
    volatile uint32_t SCS : 4;          // [27:24] Clock source: 3=Fast IRC (FIRC_CLK); 6=SPLL_CLK
    volatile uint32_t rsv31_28 : 4;     // [31:28]
} scg_rccr_bits_t;

typedef union scg_rccr_reg_t {
    volatile uint32_t value;         // reset value 030*_0001h
    scg_rccr_bits_t bits;
} scg_rccr_reg_t;


/** SCG - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID Register, offset: 0x0 */
  __I  uint32_t PARAM;                             /**< Parameter Register, offset: 0x4 */
       uint8_t RESERVED_0[8];
  __I  uint32_t CSR;                               /**< Clock Status Register, offset: 0x10 */
  __IO uint32_t RCCR;                              /**< Run Clock Control Register, offset: 0x14 */
  __IO uint32_t VCCR;                              /**< VLPR Clock Control Register, offset: 0x18 */
  __IO uint32_t HCCR;                              /**< HSRUN Clock Control Register, offset: 0x1C */
  __IO uint32_t CLKOUTCNFG;                        /**< SCG CLKOUT Configuration Register, offset: 0x20 */
       uint8_t RESERVED_1[220];
  __IO uint32_t SOSCCSR;                           /**< System OSC Control Status Register, offset: 0x100 */
  __IO uint32_t SOSCDIV;                           /**< System OSC Divide Register, offset: 0x104 */
  __IO uint32_t SOSCCFG;                           /**< System Oscillator Configuration Register, offset: 0x108 */
       uint8_t RESERVED_2[244];
  __IO uint32_t SIRCCSR;                           /**< Slow IRC Control Status Register, offset: 0x200 */
  __IO uint32_t SIRCDIV;                           /**< Slow IRC Divide Register, offset: 0x204 */
  __IO uint32_t SIRCCFG;                           /**< Slow IRC Configuration Register, offset: 0x208 */
       uint8_t RESERVED_3[244];
  __IO uint32_t FIRCCSR;                           /**< Fast IRC Control Status Register, offset: 0x300 */
  __IO uint32_t FIRCDIV;                           /**< Fast IRC Divide Register, offset: 0x304 */
  __IO uint32_t FIRCCFG;                           /**< Fast IRC Configuration Register, offset: 0x308 */
       uint8_t RESERVED_4[756];
  __IO uint32_t SPLLCSR;                           /**< System PLL Control Status Register, offset: 0x600 */
  __IO uint32_t SPLLDIV;                           /**< System PLL Divide Register, offset: 0x604 */
  __IO uint32_t SPLLCFG;                           /**< System PLL Configuration Register, offset: 0x608 */
} SCG_Type;


// Special CNT values:
// All other writes to register CNT are illegal and force a reset
#define WDOG_UNLOCK_SEQUENCE  0xD928C520
#define WDOG_REFRESH_SEQUENCE 0xB480A602

// Watchdog Control and Status register
typedef struct wdog_cs_bits_t {
    volatile uint32_t STOP : 1;         // [0] Stop enable: 0=wdog disabled in stop mode
    volatile uint32_t WAIT : 1;         // [1] Wait enable: 0=wdog disabled in wait mode
    volatile uint32_t DBG : 1;          // [2] Debug enable: 0=wdog disabled in debug mode
    volatile uint32_t TST : 2;          // [4:3] Fast Test mode enable
    volatile uint32_t UPDATE : 1;       // [5] Allow updates: 0=not allowed
    volatile uint32_t INT : 1;          // [6] Interrupt: 0=disabled
    volatile uint32_t EN : 1;           // [7] Enable: 1=enabled
    volatile uint32_t CLK : 2;          // [9:8] Clock: 0=bus; 1=LPO; 2=Internal clock; 3=external ref clock
    volatile uint32_t RCS : 1;          // [10] Reconfiguration success
    volatile uint32_t ULK : 1;          // [11] Unlock status: 1=wdog is unlocked
    volatile uint32_t PRES : 1;         // [12] Prescale: 0=256 prescale disabled
    volatile uint32_t CMD32EN : 1;      // [13] 32-bits refresh/unlock commmand: 1=enabled
    volatile uint32_t FLG : 1;          // [14] Interrupt flag: 0=no interrupt occured
    volatile uint32_t WIN : 1;          // [15] Watchdog window: 0=disabled
    volatile uint32_t rsv31_16 : 16;    // [31:16]
} wdog_cs_bits_t;

typedef union wdog_cs_reg_t {
    volatile uint32_t value;            // reset value 0000_2980h
    wdog_cs_bits_t bits;
} wdog_cs_reg_t;

typedef struct {
    __IO uint32_t CS;                   // Watchdog Control and Status Register, offset: 0x0
    __IO uint32_t CNT;                  // Watchdog Counter Register, offset: 0x4
    __IO uint32_t TOVAL;                // Watchdog Timeout Value Register, offset: 0x8
    __IO uint32_t WIN;                  // Watchdog Window Register, offset: 0xC
} WDOG_Type;





