sergeykhbr/gardemarin/examples/sim/libst32sim/src/s32k148regs.h
// S32K148EVB board
#define LED_RED		21U
#define LED_GREEN	22U
#define LED_BLUE	23U
#define SW3		12U  // PTC12
#define SW4		13U  // PTC13


#define CAN0_BASE                                (0x40024000u)
#define CAN1_BASE                                (0x40025000u)
#define CAN2_BASE                                (0x4002B000u)
#define LPIT0_BASE                               (0x40037000u)
#define PORTA_BASE                               (0x40049000u)
#define PORTB_BASE                               (0x4004A000u)
#define PORTC_BASE                               (0x4004B000u)
#define PORTD_BASE                               (0x4004C000u)
#define PORTE_BASE                               (0x4004D000u)
#define WDOG_BASE                                (0x40052000u)
#define SCG_BASE                                 (0x40064000u)
#define PCC_BASE                                 (0x40065000u)
#define LPUART0_BASE                             (0x4006A000u)
#define LPUART1_BASE                             (0x4006B000u)
#define LPUART2_BASE                             (0x4006C000u)
#define PTA_BASE                                 (0x400FF000u)
#define PTC_BASE                                 (0x400FF080u)
#define PTD_BASE                                 (0x400FF0C0u)
#define PTE_BASE                                 (0x400FF100u)
#define S32_SCB_BASE                             (0xE000E000u)
#define S32_NVIC_BASE                            (0xE000E100u)
#define LMEM_BASE                                (0xE0082000u)

/* LPIT - Peripheral instance base addresses */
#define LPIT0                                    ((LPIT_Type *)LPIT0_BASE)
/* PORT - Peripheral instance base addresses */
#define PORTA                                    ((PORT_Type *)PORTA_BASE)
#define PORTB                                    ((PORT_Type *)PORTB_BASE)
#define PORTC                                    ((PORT_Type *)PORTC_BASE)
#define PORTD                                    ((PORT_Type *)PORTD_BASE)
#define PORTE                                    ((PORT_Type *)PORTE_BASE)
/* GPIO - Peripheral instance base addresses */
#define PTA                                      ((GPIO_Type *)PTA_BASE)
#define PTB                                      ((GPIO_Type *)PTB_BASE)
#define PTC                                      ((GPIO_Type *)PTC_BASE)
#define PTD                                      ((GPIO_Type *)PTD_BASE)
#define PTE                                      ((GPIO_Type *)PTE_BASE)
/* PCC */
#define PCC                                      ((PCC_Type *)PCC_BASE)
/* NVIC */
#define S32_NVIC                                 ((S32_NVIC_Type *)S32_NVIC_BASE)
/* S32_SCB - Peripheral instance base addresses */
#define S32_SCB                                  ((S32_SCB_Type *)S32_SCB_BASE)
/* WDOG */
#define WDOG                                     ((WDOG_Type *)WDOG_BASE)
/* SCG - Peripheral instance base addresses */
#define SCG                                      ((SCG_Type *)SCG_BASE)
/* Peripheral LPUARTx base address */
#define LPUART0                                  ((LPUART_Type *)LPUART0_BASE)
#define LPUART1                                  ((LPUART_Type *)LPUART1_BASE)
#define LPUART2                                  ((LPUART_Type *)LPUART2_BASE)
/* Peripheral LMEM base pointer */
#define LMEM                                     ((LMEM_Type *)LMEM_BASE)
/* CAN - Peripheral instance base addresses */
#define CAN0                                     ((CAN_Type *)CAN0_BASE)
#define CAN1                                     ((CAN_Type *)CAN1_BASE)
#define CAN2                                     ((CAN_Type *)CAN2_BASE)
